[
  {
    "company_name": "SnapMagic",
    "batch": "S15",
    "description": "AI copilot for electronics design",
    "company_link": "https://www.workatastartup.com/companies/snapmagic",
    "job_name": "Lead Principal Engineer",
    "job_link": "https://www.ycombinator.com/companies/snapmagic/jobs/cU7g2O2-lead-principal-engineer",
    "job_type": "fulltime",
    "location": "Redwood City, CA, US",
    "tech_stack": "Backend",
    "founders": [
      {
        "name": "Natasha Baker",
        "linkedin_url": "https://www.linkedin.com/in/natashaabaker"
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Lead Principal Engineer\n\n**Job Summary:** \nThe Lead Principal Engineer will lead the software engineering efforts at SnapMagic, reporting directly to the CEO. The role involves driving product velocity and satisfaction, ensuring the delivery of world-class products for electrical engineers.\n\n**Responsibilities:**\n\n* **Technical Development:**\n\t+ Own all software developed and maintained by the company\n\t+ Code, troubleshoot, and design architecture across the stack\n\t+ Identify and address infrastructure challenges\n\t+ Work collaboratively to plan and execute sprints\n\t+ Manage and mentor developers\n\t+ Write or review technical specs as needed\n\t+ Track, analyze, and improve engineering metrics\n\t+ Create an environment of continuous improvement and excellence\n\t+ Recruit and assess new candidates for the team\n* **Management:**\n\t+ Recruit, onboard, and develop a high-performing engineering team\n\t+ Foster a culture of collaboration, mentorship, and continuous improvement\n\t+ Drive performance through KPIs, OKRs, and sprint planning\n\t+ Serve as the primary point of contact for all software engineering efforts\n* **Long-term planning:**\n\t+ Proactively identify and mitigate software challenges to ensure reliability and scalability\n\t+ Own the roadmap for current and future infrastructure and architecture needs\n\t+ Collaborate cross-functionally to align engineering initiatives with business goals\n\n**Requirements:**\n\n* **Who You Are:**\n\t+ High Horsepower: Learn quickly and adapt to new challenges with ease\n\t+ Energetic and Team-Oriented: Foster collaboration and bring good energy to the team\n\t+ Clear and Responsive Communicator: Communicate directly and effectively\n\t+ Humble: Focus on the team's success\n\t+ Track Record of Success: Demonstrate achievements in similar roles or organizations\n\t+ Resourceful and Resilient: Thrive in ambiguity, find creative solutions, and tackle tedious tasks with determination\n\t+ Product-Obsessed: Empathize with users, anticipate their needs, and deliver exceptional experiences\n\t+ Results-driven: Want to make an impact and drive the ball forward\n* **Qualifications:**\n\t+ 5+ years of software engineering experience with a strong track record of building robust applications\n\t+ 5+ years of management experience, leading and scaling engineering teams\n\t+ Expertise in back-end development, with proficiency in Python, Django, and PostgreSQL\n\t+ Proficiency in front-end frameworks like Vue or React and experience with RESTful APIs and microservices\n\t+ Familiarity with cloud platforms (Heroku, Azure, AWS) and database management\n\t+ Experience designing scalable architectures and solving complex infrastructure issues\n\n**Nice to Haves:**\n\n* Experience with desktop application development\n* Familiarity with AI tech stacks and computer-aided design software\n* Background in electronic circuit design or electrical engineering\n\n**Perks and Benefits:**\n\n* Competitive compensation packages\n* Comprehensive medical, dental, and vision coverage\n* 401k plan\n* Hybrid work environment with in-person collaboration three days a week\n* Catered lunches\n* Opportunities for career growth and significant impact on a groundbreaking product\n* A culture of innovation and creativity"
  },
  {
    "company_name": "Wefunder",
    "batch": "W13",
    "description": "We're Robinhood for pre-IPO startups. Everyone can invest $100.",
    "company_link": "https://www.workatastartup.com/companies/wefunder",
    "job_name": "Full Stack, Senior Software Engineer",
    "job_link": "https://www.ycombinator.com/companies/wefunder/jobs/oC8Vfe1-full-stack-senior-software-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Greg Belote",
        "linkedin_url": "https://www.linkedin.com/in/gregbelote/"
      },
      {
        "name": "Nick Tommarello",
        "linkedin_url": "https://www.linkedin.com/in/nicktommarello/",
        "bio": "CEO, Wefunder"
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Full Stack, Senior Software Engineer\n\n**Job Summary:**\n\n* We're looking for engineers who can help us wrangle complex systems and delight users along the way.\n* As a Wefunder engineer, you'll have a tremendous amount of influence, ability to make a huge impact, and be expected to work on a little of everything.\n\n**Responsibilities:**\n\n* Work on complex systems and delight users\n* Make a huge impact and work on a little of everything\n* Mentor others (our current team skews junior, but highly talented)\n\n**Requirements:**\n\n* Experience working with complexity\n* Ability to deal with the chaos and ambiguity of a startup\n* Attention to detail\n* Ability to mentor others\n* Expert in Ruby on Rails or similar toolset (like django or Node)\n* Expert in Javascript/CSS and experience with a framework like React\n* Experience with a relational SQL database (we use Postgres)\n* Understanding of accessibility, SEO, responsive design, and website performance\n\n**Nice to Have:**\n\n* Experience with payments, security, or \"compliance\"-type problems\n* Scaled systems with 100k/1m/10m/100m/1b transactions\n* You are a former founder or a future one - the problem we’re working to solve feels personal to you\n\n**What We Offer:**\n\n* $160k - $250k plus equity depending on experience\n* Unlimited vacation days (mandatory 3 weeks off)\n* Medical, dental, & vision insurance\n* 401K\n* Apple equipment (whatever you want)\n* Lots of free food and drinks\n* Reimbursement for classes and conferences\n\n**How to Apply:**\n\n* Email dinki[at]wefunder.com with your CV or LinkedIn and why you'd like to work with us."
  },
  {
    "company_name": "Helpcare AI",
    "batch": "F24",
    "description": "AI Workers for Healthcare Orgs to Find, Call & Schedule More Patients.",
    "company_link": "https://www.workatastartup.com/companies/helpcare-ai",
    "job_name": "Senior Fullstack Engineer",
    "job_link": "https://www.ycombinator.com/companies/helpcare-ai/jobs/iuk6sAt-senior-fullstack-engineer",
    "job_type": "fulltime",
    "location": "US / CA / MX / BR / AR / BY / UY / PL / EC / CR / PA / CL / CO / RO / PE / BG / Remote (US; CA; MX; BR; AR; BY; UY; PL; EC; CR; PA; CL; CO; RO; PE; BG)",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Huzaifa Sial",
        "linkedin_url": "https://www.linkedin.com/in/hsial/",
        "bio": "Founder and CEO of Helpcare AI.\n\nHuzaifa has a Masters in Clinical Informatics form Northwestern and has spent 14+ yrs building Healthcare AI solutions like disease prediction, DME optimization, patient engagement, care delivery search and behavioral engines for care gap closures, for some of the largest Payers & Providers. He has authored 4 Health AI Patents.\n\nPreviously, Huzaifa led AI Solutions @ United Healthcare & Optum and was part of 2 healthcare AI exits."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Requirements:**\n\n* Worked at an early-stage startup (pre-seed, seed, series A)\n* 5 years of full-stack experience (python, react preferred, open to other)\n* Some experience with LLM / Agentic Applications\n\n**Job Benefits:**\n\n* Great opportunity for remote candidates\n* $120,000 / yr salary\n* Flexible timezones (US-CAN-LATAM Timezones Preferred, open to others)\n\n**Tech Stack:**\n\n* Python\n* React\n* Fast API\n* Supabase\n\n**Company Culture:**\n\n* Mission to improve the world's capacity for care\n* Respectful, intelligent, positive team\n* A-players that are excited to build the best\n* Well funded, YC- Company with incredible customer demand"
  },
  {
    "company_name": "Sphinx",
    "batch": "F24",
    "description": "AI Compliance Analysts for Banks & Fintechs",
    "company_link": "https://www.workatastartup.com/companies/sphinx",
    "job_name": "Founding Engineer",
    "job_link": "https://www.ycombinator.com/companies/sphinx/jobs/mlOP28j-founding-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Backend",
    "founders": [
      {
        "name": "Alexandre Berkovic",
        "linkedin_url": "https://linkedin.com/in/alexandreberkovic",
        "bio": "Co-founder and CEO of Sphinx. Previously co-founded Adorno AI, developing audio generation models for video. Studied Design Engineering at Imperial College and Machine Learning at MIT."
      },
      {
        "name": "Chrisjan Wust",
        "linkedin_url": "https://linkedin.com/in/chrisjan-wust",
        "bio": "Co-founder and CTO of Sphinx. Previously co-founded Adorno AI, developing video-to-audio models, and served as Head of ML at RelyComply, where I helped scale the company from $0-12M ARR and secured a deal with Africa’s largest bank. Metal + tea = code. Originally from Cape Town 🇿🇦"
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Founding Engineer (not explicitly mentioned, but implied as \"Sphinx's first founding engineer\")\n\n**Job Summary:**\n\n* Work directly with the founders to shape the future of the company\n* Make key technical decisions, build the product, and help assemble a team of A-players\n* Take the lead on one of two big endeavors: a Generalizable Robotic Process Automation (RPA) Agent or a Knowledge Graph of All the Bad People in the World\n\n**Responsibilities:**\n\n* Build ML systems from notebook to AWS\n* Work on one of the two projects:\n\t+ A Generalizable Robotic Process Automation (RPA) Agent:\n\t\t- Operating in an industry where mistakes cost a minimum of $250k\n\t\t- Think Claude Computer Use, but better\n\t+ A Knowledge Graph of All the Bad People in the World:\n\t\t- Leveraging LLMs, graph databases, and website-agnostic scraping\n\t\t- Built to handle millions of pages per day at scale\n\n**Requirements:**\n\n* No ego: Company > team > self\n* Love working hard: This isn't a \"chill\" job – it will be intense, demanding, and incredibly rewarding\n* Speedy coder: You love complex problems and designing the simplest solution for them\n* Client-Driven: We don’t code in the dark. Everything we build is 100% based on client need\n* Ownership: You don’t wait for permission – you see problems, solve them, and own the outcome\n\n**Tech Stack:**\n\n* Python\n* LLMs\n* VLMs\n* Traditional ML\n* Django\n* Docker\n* Postgres\n* AWS"
  },
  {
    "company_name": "SimCare AI",
    "batch": "S24",
    "description": "Conversations with AI patients to scale healthcare training.",
    "company_link": "https://www.workatastartup.com/companies/simcare-ai",
    "job_name": "Founding Engineer",
    "job_link": "https://www.ycombinator.com/companies/simcare-ai/jobs/PZed3Sb-founding-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US / Remote (US)",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Tiko Bdoyan",
        "linkedin_url": "https://www.linkedin.com/in/tigran-bdoyan/details/experience/",
        "bio": "Founder at Soma Lab passionate about educational technology and the future of learning. Previously, I was a Machine Learning researcher and a varsity wrestler at the University of Chicago."
      },
      {
        "name": "Vrishank Saini",
        "linkedin_url": "https://www.linkedin.com/in/vrishanksaini/",
        "bio": "Vrishank Saini is a University of Chicago neuroscience undergrad with a knack for blending neuroscience and computer science to drive innovation in medical education. As the founder of Bioscope Wellness and Soma Lab, he's not just studying cross-disciplinary subjects—he's applying them, evidenced by his development of a mental health app that garnered national coverage and over 120,000 downloads."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Summary:**\nThe company is looking for someone to craft AI-powered applications from the ground up using Next.js, Node, Supabase, and AWS. The job involves building AI sims for healthcare students and workers to talk to and get instant, data-driven insights.\n\n**Responsibilities:**\n\n* Building entire features from scratch, from initial idea to production\n* Working with agentic flows on both the patient side and evaluation system\n* Designing application architecture and agent orchestration\n* Collaborating with co-founders to shape the product's direction\n\n**Requirements:**\n\n* At least 1+ years of full-stack experience\n* Comfortable with the stack (Next.js, Node, Supabase, AWS)\n* Founding experience (either as an early employee or founder)\n\n**Nice to Have:**\n\n* Experience with building AI-powered applications\n* Knowledge of LLM magic and its applications in healthcare training\n\n**Work Environment:**\n\n* Fast-moving environment where things might break\n* Collaborative culture with co-founders and a small team\n* Requires being in person in New York City (with flexibility for the first 1-2 months)\n\n**Compensation:**\n\n* Salary range: $90K – $180K\n* Equity: 0.5% – 2.0%\n\n**Company Information:**\n\n* Sim Care AI is a company that's actively causing a fundamental shift in healthcare training\n* Already in over 30 institutions that rely on their tech to train tomorrow's doctors and nurses\n* Has major contracts with big companies like McGraw Hill"
  },
  {
    "company_name": "SimCare AI",
    "batch": "S24",
    "description": "Conversations with AI patients to scale healthcare training.",
    "company_link": "https://www.workatastartup.com/companies/simcare-ai",
    "job_name": "Ex-Founder",
    "job_link": "https://www.ycombinator.com/companies/simcare-ai/jobs/KowU0FS-ex-founder",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Tiko Bdoyan",
        "linkedin_url": "https://www.linkedin.com/in/tigran-bdoyan/details/experience/",
        "bio": "Founder at Soma Lab passionate about educational technology and the future of learning. Previously, I was a Machine Learning researcher and a varsity wrestler at the University of Chicago."
      },
      {
        "name": "Vrishank Saini",
        "linkedin_url": "https://www.linkedin.com/in/vrishanksaini/",
        "bio": "Vrishank Saini is a University of Chicago neuroscience undergrad with a knack for blending neuroscience and computer science to drive innovation in medical education. As the founder of Bioscope Wellness and Soma Lab, he's not just studying cross-disciplinary subjects—he's applying them, evidenced by his development of a mental health app that garnered national coverage and over 120,000 downloads."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Ex-Founder at SimCare AI\n\n**About the Role:**\n\n* The company is looking for founders who have experience building something from scratch and want to apply their skills to healthcare's biggest bottleneck.\n* The ideal candidate has been in the trenches and wants to start again, but better.\n\n**Job Description:**\n\n* The company is scaling all healthcare training and evaluation with AI patients that transform how clinicians learn.\n* The platform is becoming the backbone of clinical skill development.\n* The goal is to become the universal evaluation layer for all of healthcare.\n\n**Requirements:**\n\n* The ideal candidate has founded something before (successfully or not).\n* They can switch between big vision thinking and getting their hands dirty with implementation.\n* They are comfortable with ambiguity and making decisions with imperfect information.\n* Building things people actually use brings them genuine joy.\n\n**Not Suitable For:**\n\n* Those looking for a calm 9-5 job.\n* Those who need extensive onboarding and hand-holding.\n* Those who prioritize process over building new solutions.\n* Those who prefer maintaining stable systems over building new, sometimes messy solutions.\n* Those looking for a purely technical role with no strategic input or vice versa.\n\n**Why Join Now:**\n\n* The company is already working with 40+ institutions, including a 7-figure contract.\n* They're experiencing scaling problems weekly and need someone to help transform healthcare training.\n* This is an opportunity to be part of building something that will be in the future, and doing it right.\n\nLet me know if you'd like me to extract any specific information or clarify any points!"
  },
  {
    "company_name": "Voker",
    "batch": "S24",
    "description": "No-Code AI Builder",
    "company_link": "https://www.workatastartup.com/companies/voker",
    "job_name": "Founding Full Stack AI Software Engineer",
    "job_link": "https://www.ycombinator.com/companies/voker/jobs/XCcmcEk-founding-full-stack-ai-software-engineer",
    "job_type": "fulltime",
    "location": "Los Angeles, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Tyler Postle",
        "linkedin_url": "https://www.linkedin.com/in/tyler-postle/",
        "bio": "Co-Founder of Voker. In previous roles, I've built applied data products that drive growth. I was an operator of a $100MM DTC ecomm company and ran revenue growth data science for a $10B public SaaS company. I'm passionate about building high performing teams and continuously learning."
      },
      {
        "name": "Alex Rudolph",
        "linkedin_url": "https://www.linkedin.com/in/alex-r-87470a198/",
        "bio": "Co-Founder of Voker, the Self-Serve AI Builder for Product Teams"
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Founding Full Stack AI Software Engineer\n\n**Job Summary:**\nThe job involves playing a key role in the development of Voker's platform, working alongside the CTO and core team to build out the technology stack and deliver customer-driven AI solutions.\n\n**Responsibilities:**\n\n* Develop robust features to production with proper architecture, testing, and design\n* Care about the end customer's pains and want to know how your code is impacting them\n* Work closely with the CTO and engineering team to shape the future of the product\n\n**Requirements:**\n\n* Must have at least 1 year of experience as a Senior Software Engineer and 4+ years of experience engineering in total\n* Must have 2 years of experience developing AI applications with Large Language Models (LLMs) and systems such as retrieval-based methods, fine-tuning, or agent-based architectures\n* Must have experience with AI frameworks like Langchain, Llama Index, OpenAI, or similar tools\n* Must be willing to work in person, next to the CTO, CEO, and engineering team, 6 days a week\n* Must have experience with: Svelte, Python, TypeScript, Postgres\n* Must be enthusiastic about the challenges and opportunities of working at a very early startup\n* Must enjoy being a part of a small, tight-knit team where your contributions will directly impact the success of the company\n\n**Nice to Have:**\n\n* Experience deploying, monitoring, and maintaining large language models (LLMs) models in production\n* Previous startup experience"
  },
  {
    "company_name": "Distro",
    "batch": "S24",
    "description": "The AI co-pilot for sales reps at industrial wholesale distributors.",
    "company_link": "https://www.workatastartup.com/companies/distro",
    "job_name": "Senior Software Engineer",
    "job_link": "https://www.ycombinator.com/companies/distro/jobs/nZB8oET-senior-software-engineer",
    "job_type": "fulltime",
    "location": "Palo Alto, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Jason Sullivan",
        "linkedin_url": "https://linkedin.com/in/jasoncsullivan",
        "bio": "Jason is the founder and CEO of Distro, the all-in-one AI co-pilot for counter staff and inside sales at industrial wholesale distributors. He is a repeat founder, having previously co-founded Vested. Before Vested, he was CTO at Elementus, Tech Lead at Coatue, and Senior Software Engineer at PeerIQ. In a prior life, Jason was a credit derivatives trader.\n\nJason holds an MS in Computer Science from Stanford and a BA in Cognitive Science from Yale."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I can extract the following information related to the job description:\n\n**Job Title:** Senior or Staff Software Engineer\n\n**Job Requirements:**\n\n* Professional experience in the platform portion of the tech stack, specifically:\n\t+ Next.js/React\n\t+ TypeScript\n\t+ MongoDB\n* Strong interest and desire to learn AI/ML frameworks (nice-to-have, but not required)\n* Infra/devOps experience (bonus points, but not required)\n\n**Job Summary:** The company is seeking an experienced Senior or Staff Software Engineer to join their growing tech team."
  },
  {
    "company_name": "Distro",
    "batch": "S24",
    "description": "The AI co-pilot for sales reps at industrial wholesale distributors.",
    "company_link": "https://www.workatastartup.com/companies/distro",
    "job_name": "Tech Lead",
    "job_link": "https://www.ycombinator.com/companies/distro/jobs/XGMjSPe-tech-lead",
    "job_type": "fulltime",
    "location": "Palo Alto, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Jason Sullivan",
        "linkedin_url": "https://linkedin.com/in/jasoncsullivan",
        "bio": "Jason is the founder and CEO of Distro, the all-in-one AI co-pilot for counter staff and inside sales at industrial wholesale distributors. He is a repeat founder, having previously co-founded Vested. Before Vested, he was CTO at Elementus, Tech Lead at Coatue, and Senior Software Engineer at PeerIQ. In a prior life, Jason was a credit derivatives trader.\n\nJason holds an MS in Computer Science from Stanford and a BA in Cognitive Science from Yale."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Tech Lead\n\n**Primary Job Description:** \"get things done/make sure things get done\"\n\n**Key Traits:**\n\n1. Ownership mentality\n2. Clear communication\n3. Accountability\n4. Reliability\n\n**Responsibilities:**\n\n1. Managing and delegating to engineers\n2. Coding (significant amount for the foreseeable future)\n3. Running standups\n4. Managing projects\n\n**Technical Requirements:**\n\n1. Professional experience in Next.js/React\n2. Professional experience in TypeScript\n3. Professional experience in MongoDB\n4. Strong interest and desire to learn AI/ML frameworks (nice-to-have)\n5. Infra/devOps experience (bonus points)\n\n**Location Preference:** Bay Area candidates strongly preferred.\n\nLet me know if you'd like me to extract any other information!"
  },
  {
    "company_name": "Conveo",
    "batch": "S24",
    "description": "Qualitative Research Conducted and Analyzed by AI",
    "company_link": "https://www.workatastartup.com/companies/conveo",
    "job_name": "Senior Full Stack Engineer (React + TypeScript)",
    "job_link": "https://www.ycombinator.com/companies/conveo/jobs/OcMOJXI-senior-full-stack-engineer-react-typescript",
    "job_type": "fulltime",
    "location": "Antwerp, Flanders, BE",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Dieter De Mesmaeker",
        "linkedin_url": "https://www.linkedin.com/in/dieterdemesmaeker/",
        "bio": "Co-Founder & CTO @Conveo.ai, previously Co-Founder & CTO @Datacamp.com (+$60m ARR)"
      },
      {
        "name": "Hendrik Van Hove",
        "linkedin_url": "https://linkedin.com/in/hendrik-van-hove",
        "bio": "Belgian, 26, passionate about tech and (kite-) surfing.\nBuilding Conveo.ai, qualitative research at scale with AI interviews and analysis.\nWorked at McKinsey in tech/AI and private equity projects. Background in finance with internships at Morgan Stanley (IBD), Lazard (IBD), PE.\nMSc Business Engineering and MSc Artificial Intelligence (majority coursework, did not graduate)."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Senior Engineer (not explicitly mentioned, but implied by the job description)\n\n**Job Summary:**\n\n* Lead the development of impactful features and projects\n* Build an application with AI at its core\n* Participate in product refinement, brainstorming, and prioritization sessions\n* Work closely with the OpenAI team to stay on the cutting edge of AI technology\n\n**Responsibilities:**\n\n* Lead the end-to-end development of features and projects\n* Build an application with AI as the core\n* Take part in product refinement, brainstorming, and prioritization sessions\n* Impact both WHAT and HOW the company builds its products\n\n**Requirements:**\n\n* 5+ years of experience working with React and TypeScript\n* Experience with Remix is a plus\n* Can independently lead projects from concept to launch\n* Excellent written and verbal communication skills in English\n* Deep understanding of TypeScript fundamentals\n* Experience building scalable full-stack applications\n* Experience building AI-driven applications (e.g., prompt engineering and/or fine-tuning experience) is a plus\n* Collaborative mindset, able to work autonomously in a small, fast-paced team\n\n**What the Company Offers:**\n\n* Interesting and impactful work, shaping the future of customer research\n* Competitive salary and stock options\n* Flexible working hours and PTO\n* Regular team off-sites and remote-friendly team culture\n* Work with the latest AI models at the cutting edge of what's possible\n* Work with a highly experienced technical team (only hiring senior engineers)\n\n**Tech Stack:**\n\n* Application: Remix app (React Router v7 + TypeScript), Tailwind, shadcn/ui, PostgreSQL, etc.\n* AI: OpenAI, Deepgram, LangChain, LangSmith, etc.\n* Infrastructure: Google Cloud Platform, Inngest, Sentry, etc.\n* Tooling: GitHub, Linear, Slack, Notion, etc."
  },
  {
    "company_name": "Kastle",
    "batch": "S24",
    "description": "AI agents for mortgage servicing",
    "company_link": "https://www.workatastartup.com/companies/kastle",
    "job_name": "Founding Applied AI Engineer at Kastle",
    "job_link": "https://www.ycombinator.com/companies/kastle/jobs/XSq5nJT-founding-applied-ai-engineer-at-kastle",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Backend",
    "founders": [
      {
        "name": "Rishi Choudhary",
        "linkedin_url": "https://www.linkedin.com/in/choudharyrishi/",
        "bio": "Rishi is the co-founder and CEO of Kastle (www.kastle.ai)\n\nBefore Kastle, Rishi was the founding Product Manager for Redfin’s Mortgage Marketplace at age 22 and grew the business from $3M to $6M in revenue in 9 months. He also led Redfin's Search Experience team responsible for 80% of the company's traffic. \n\nRishi has a BS in Systems Engineering from the University of Illinois at Urbana Champaign. At UIUC, Rishi ran the largest US student consulting club with 250 students and $500K ARR"
      },
      {
        "name": "Nitish Poddar",
        "linkedin_url": "https://www.linkedin.com/in/nitish-poddar/",
        "bio": "Nitish is the co-founder and CTO of Kastle (kastle.ai). Before Kastle, Nitish was a tech lead at Verkada, where he led development for a patented motion search system and built out the entire backend inference infrastructure. He also led the firmware delivery team on a new fleet management system and led engineering for Incident Management, Verkada's newest product line. Nitish graduated from UIUC with a degree in Computer Science."
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Founding Applied AI Engineer at Kastle\n\n**Job Summary:**\nAs a Founding Applied AI Engineer, you will play a crucial role in integrating advanced AI technologies into Kastle's platform, working on fine-tuning large language models, designing AI workflows for highly regulated enterprises, and ensuring AI agents deliver precise, compliant, and effective interactions.\n\n**Responsibilities:**\n\n1. **AI Model Integration:** Fine-tune and deploy LLMs for real-time borrower interactions.\n2. **Prompt Engineering:** Design, test, and iterate on prompts to optimize AI performance and compliance.\n3. **Custom AI Solutions:** Train and implement domain-specific AI models for mortgage servicing.\n4. **Scalability & Compliance:** Ensure AI solutions meet regulatory standards (FDCPA, RESPA, TILA) and scale efficiently.\n5. **Data Pipelines & APIs:** Build robust AI-driven workflows that integrate seamlessly with loan servicing platforms.\n6. **Continuous Optimization:** Monitor AI performance, reduce error rates, and enhance borrower experience.\n\n**Requirements:**\n\n1. 3+ years in applied AI, ML engineering, or a related role.\n2. Proficiency in Python, TensorFlow/PyTorch, and deep learning frameworks.\n3. Experience fine-tuning LLMs (Llama, GPT) and designing AI prompt workflows.\n4. Strong product mindset—ability to bridge AI capabilities with real-world mortgage servicing needs.\n5. Understanding of mortgage regulations (or willingness to learn) to ensure AI compliance.\n6. Experience with deploying AI models into production and optimizing for speed and accuracy.\n7. Strong communication skills to collaborate with product, engineering, and compliance teams.\n\n**What the Company Offers:**\n\n1. Be part of a fast-growing AI startup shaping the future of financial services.\n2. Work on cutting-edge AI technologies solving high-impact problems.\n3. Collaborate with a top-tier team backed by leading investors.\n4. Competitive salary, early-stage equity, and ownership over AI strategy."
  },
  {
    "company_name": "Kastle",
    "batch": "S24",
    "description": "AI agents for mortgage servicing",
    "company_link": "https://www.workatastartup.com/companies/kastle",
    "job_name": "Founding Engineer at Kastle (S24)",
    "job_link": "https://www.ycombinator.com/companies/kastle/jobs/ItDVKB7-founding-engineer-at-kastle-s24",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Rishi Choudhary",
        "linkedin_url": "https://www.linkedin.com/in/choudharyrishi/",
        "bio": "Rishi is the co-founder and CEO of Kastle (www.kastle.ai)\n\nBefore Kastle, Rishi was the founding Product Manager for Redfin’s Mortgage Marketplace at age 22 and grew the business from $3M to $6M in revenue in 9 months. He also led Redfin's Search Experience team responsible for 80% of the company's traffic. \n\nRishi has a BS in Systems Engineering from the University of Illinois at Urbana Champaign. At UIUC, Rishi ran the largest US student consulting club with 250 students and $500K ARR"
      },
      {
        "name": "Nitish Poddar",
        "linkedin_url": "https://www.linkedin.com/in/nitish-poddar/",
        "bio": "Nitish is the co-founder and CTO of Kastle (kastle.ai). Before Kastle, Nitish was a tech lead at Verkada, where he led development for a patented motion search system and built out the entire backend inference infrastructure. He also led the firmware delivery team on a new fleet management system and led engineering for Incident Management, Verkada's newest product line. Nitish graduated from UIUC with a degree in Computer Science."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Founding Engineer at Kastle\n\n**Job Type:** Founding Backend Engineer\n\n**Job Summary:**\n\n* Build and optimize Kastle's AI infrastructure\n* Architect and scale AI systems, ensuring high availability, low latency, and compliance with strict financial regulations\n* Work closely with the founding team to design, develop, and deploy mission-critical AI applications that integrate with financial institutions\n\n**Responsibilities:**\n\n* Architect and develop scalable backend services for AI-driven mortgage servicing applications\n* Design and implement APIs that integrate with loan servicing platforms, payment processors, and compliance systems\n* Optimize performance for real-time AI interactions, ensuring sub-700ms latency\n* Manage containerized deployments using Kubernetes to maintain high availability and reliability\n* Develop event-driven architectures using Python AsyncIO for parallel processing and real-time automation\n* Ensure security and compliance with financial regulations (SOC 2, FDCPA, RESPA, TILA)\n* Own the full development lifecycle—from designing scalable solutions to deploying and monitoring them in production\n\n**Minimum Requirements:**\n\n* 1+ years of backend engineering experience in high-velocity environments\n* Expertise in Python, with strong knowledge of AsyncIO, FastAPI, or Django\n* Experience with containerization and orchestration tools, including Docker and Kubernetes\n* Proficiency in designing and optimizing distributed systems, with a focus on high-availability architectures\n* Familiarity with event-driven architectures and message queues (e.g., Kafka, RabbitMQ, or Redis Streams)\n* Strong database skills, including PostgreSQL or other relational/NoSQL databases\n* Knowledge of API security best practices (OAuth, JWT, rate-limiting)\n* Experience with CI/CD pipelines and DevOps tools\n* Excellent problem-solving skills and a passion for optimizing backend performance\n\n**Preferred Qualifications:**\n\n* Background in AI/ML-powered systems, especially LLM applications\n* Experience working with financial services or compliance-heavy industries (fintech, lending, insurance)\n* Previous startup experience, with a hands-on approach to problem-solving\n\n**Benefits:**\n\n* Build and scale AI applications that are transforming mortgage servicing\n* Work closely with a world-class founding team backed by top investors\n* High ownership and autonomy, shaping the company's technical direction\n* Competitive salary, early-stage equity, and a chance to be a foundational team member"
  },
  {
    "company_name": "Tivara",
    "batch": "S24",
    "description": "The AI workforce for medical groups",
    "company_link": "https://www.workatastartup.com/companies/tivara",
    "job_name": "Founding Product Engineer",
    "job_link": "https://www.ycombinator.com/companies/tivara/jobs/6Hhb9Oo-founding-product-engineer",
    "job_type": "fulltime",
    "location": "New York, NY, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Aumesh Misra",
        "linkedin_url": "www.linkedin.com/in/aumesh-misra",
        "bio": "Co-founder and CTO of Tivara. I've spent 4 years building software at Microsoft and Compound (YC S19). I was the 8th engineer at Compound and helped grow the company to over $2B AUM. Prior to this, I researched and developed software for novel medical imaging devices at Stanford."
      },
      {
        "name": "Tej Seelamsetty",
        "linkedin_url": "https://linkedin.com/in/tej-seelamsetty",
        "bio": "Founder and CEO of Tivara.\n\nI started my entrepreneurship journey at 18 years old: As soon as I could sign a personal guarantee, I started flipping houses to (successfully) pay for college. Building software to automate the tedious aspects of my own due diligence opened my eyes to the magic of code. Since then, I led growth (10x-ed revenue) at Fair Square (W20) and worked as a consultant at Bain. I studied computer science and financial engineering at WashU."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Product Engineer\n\n**Job Description:**\n\n* Owning entire features across the stack\n* Reporting to the CTO as one of the first hires\n* Unlocking the pipeline worth $millions in revenue due to supply constraints\n\n**Responsibilities:**\n\n* Building and being around builders\n* Fostering energizing work environments\n* Producing zero-defect work for customers\n* Being honest, kind, and low ego\n* Not making excuses\n\n**Requirements:**\n\n* No specific technical requirements mentioned, but the company uses a tech stack including React, Typescript, Node.js, Tailwind, Docker, and PostgreSQL\n* Willingness to work hard in the NYC office, five days a week\n\n**What the Company Offers:**\n\n* Competitive health, dental, and vision plans fully paid by the company\n* Guideline 401K\n* Daily in-office lunch\n* Nice gym in-office\n* Paid work trial\n\n**Company Culture:**\n\n* Customer-obsessed\n* Taking responsibility for work\n* Learning from mistakes\n* Enjoying each other's company\n\n**Interview Process:**\n\n* 15-minute chat with the CEO\n* 45-minute technical resume deep-dive and schema design exercise with the CTO\n* A take-home exercise\n* 1-hour take-home review and coding challenge\n* Paid work trial"
  },
  {
    "company_name": "Silurian",
    "batch": "S24",
    "description": "Foundation models to simulate Earth, starting with weather.",
    "company_link": "https://www.workatastartup.com/companies/silurian",
    "job_name": "Machine Learning Research Engineer / Scientist",
    "job_link": "https://www.ycombinator.com/companies/silurian/jobs/67uBjLX-machine-learning-research-engineer-scientist",
    "job_type": "fulltime",
    "location": "London, England, GB",
    "tech_stack": "Machine learning",
    "founders": [
      {
        "name": "Cristian Bodnar",
        "linkedin_url": "https://www.linkedin.com/in/crisbodnar/",
        "bio": "Chief Scientist of Silurian. I was previously a Senior Researcher at Microsoft Research where I co-lead the development of the Aurora foundation model. During my PhD at Cambridge, I've also spent time in top AI industry labs like Google Brain, Google X and Twitter Cortex."
      },
      {
        "name": "Jayesh K. Gupta",
        "linkedin_url": "https://www.linkedin.com/in/jayeshkg/",
        "bio": "Jayesh is Co-founder and CEO of Silurian AI. Previously he was the Head of AI at Poly Corporation. He led the development of the first foundation model for weather & climate as researcher at Microsoft and was the co-author of Aurora. Jayesh holds a Ph.D. in CS from Stanford."
      },
      {
        "name": "Nikhil Shankar",
        "linkedin_url": "https://www.linkedin.com/in/nikhil-shankar-3090131b7/",
        "bio": "Nikhil is a co-founder and chief engineer at Silurian AI. Previously he was a software engineer at AWS SageMaker and prior to that he dropped out of his PhD in applied mathematics where he was working on problems in fluid dynamics."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Machine Learning Research Engineers / Scientists\n\n**Role Overview:**\nThe successful candidate will develop, train and deploy to production large-scale AI foundation models for weather and energy.\n\n**Responsibilities (What You'll Do):**\n\n1. Architect and implement innovative ML models for complex spatiotemporal data analysis.\n2. Lead end-to-end development of large-scale AI systems, from research to production.\n3. Drive the optimisation of training and inference pipelines for maximum performance.\n4. Conduct validation experiments and performance analysis.\n5. Spearhead long-term research initiatives with significant real-world impact.\n6. Collaborate with world-class researchers and engineers.\n\n**Requirements (We expect you to have):**\n\n1. Proven track record in developing and deploying deep learning models.\n2. Advanced proficiency in Python and modern ML frameworks (PyTorch, TensorFlow, Jax).\n3. Demonstrated experience with distributed training systems and large-scale data pipelines.\n4. Strong software engineering practices and system design principles.\n5. Excellent problem-solving and analytical skills.\n6. Outstanding communication and collaboration abilities.\n\n**Nice to Have:**\n\n1. MSc or PhD in Artificial Intelligence, Computer Science, or related technical field.\n2. Published research in prestigious AI conferences/journals (NeurIPS, ICML, etc.).\n3. Hands-on experience with one or several of the following: transformers, diffusion models, self-supervised learning, foundation model training/fine-tuning.\n\nLet me know if you need any further assistance!"
  },
  {
    "company_name": "Wordware",
    "batch": "S24",
    "description": "IDE to develop, iterate and deploy AI Agents",
    "company_link": "https://www.workatastartup.com/companies/wordware",
    "job_name": "engineering",
    "job_link": "https://www.ycombinator.com/companies/wordware/jobs/NXAEgOb-engineering",
    "job_type": "fulltime",
    "location": "San Francisco",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Robert Chandler",
        "linkedin_url": "https://linkedin.com/in/robertjhchandler",
        "bio": "Robert Chandler is a founder & CTO at Wordware. \n\nHe started his career as an early engineer at a self-driving car startup, Five AI, which was acquired by Bosch. Here he lead the Offline Perception team which accelerated the dev-test cycle through automated ground truthing and was awarded 5+ patents in the process.\n\nHe has been in the AI space for over a decade since studying Information Engineering at the University of Cambridge."
      },
      {
        "name": "Filip Kozera",
        "linkedin_url": "https://linkedin.com/in/filipkozera",
        "bio": "Cofounder and CEO at Wordware -- an IDE for Natural Language Programming and Agent Orchestration. Previously I cofounded and exited KRISTALIC, which tried to augment the human memory. Before that, I studied Deep Learning at Cambridge. \n\nThe most interesting fact about me outside of work is that I travelled to 103 countries and was part of multiple high-altitude mountaineering expeditions and rescue operations in Kyrgyzstan and Nepal. I also do sailing, paragliding, kitesurfing and boxing."
      }
    ],
    "job_description_detailed": "After carefully extracting the relevant information, I've compiled the job description details below:\n\n**Job Summary:**\n\n* Build the foundation of an AI development platform used by hundreds of thousands of builders.\n* Craft code that shapes an entire industry.\n\n**Responsibilities:**\n\n* Architecting important components\n* Writing a significant amount of code (mostly TypeScript/Next.js)\n* Maintaining the stack's smooth operation (AWS/Cloudflare)\n* Troubleshooting and communicating with users when issues arise\n* Making product decisions on the fly\n* Solving complex problems\n\n**Requirements:**\n\n* 4+ years of experience building real products used by real people\n* Comfortable with the company's tech stack (TypeScript/Next.js, AWS/Cloudflare)\n* Enjoy the fast-paced environment of a startup\n* Experience building with AI (AI engineer)\n* Proactive in fixing issues without being asked\n* Prioritize user needs over code quality\n* Bonus points if you have founder/CTO experience or have raised VC funding\n\n**Work Environment:**\n\n* Based in San Francisco only\n* Fast-paced work environment with meals provided at the office\n* Shipping to production from day one\n* Sometimes building features without full specs\n* May need to make UX decisions when designers/founders are unavailable\n* Code will impact hundreds of thousands of developers\n* Crossbow competitions are a thing at the office\n\n**Ideal Candidate:**\n\n* Has built complex projects from scratch\n* Wants to improve developer tools\n* Interested in shaping the future of AI development\n\n**Company Details:**\n\n* Backed by Spark Capital, Felicis, and Y Combinator ($30m seed funding)\n* Works like a seed startup despite funding\n* Office amenities include a sauna and a location 30m from the sea."
  },
  {
    "company_name": "Wordware",
    "batch": "S24",
    "description": "IDE to develop, iterate and deploy AI Agents",
    "company_link": "https://www.workatastartup.com/companies/wordware",
    "job_name": "DevRel engineer",
    "job_link": "https://www.ycombinator.com/companies/wordware/jobs/Hk3pqc5-devrel-engineer",
    "job_type": "fulltime",
    "location": "San Francisco",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Robert Chandler",
        "linkedin_url": "https://linkedin.com/in/robertjhchandler",
        "bio": "Robert Chandler is a founder & CTO at Wordware. \n\nHe started his career as an early engineer at a self-driving car startup, Five AI, which was acquired by Bosch. Here he lead the Offline Perception team which accelerated the dev-test cycle through automated ground truthing and was awarded 5+ patents in the process.\n\nHe has been in the AI space for over a decade since studying Information Engineering at the University of Cambridge."
      },
      {
        "name": "Filip Kozera",
        "linkedin_url": "https://linkedin.com/in/filipkozera",
        "bio": "Cofounder and CEO at Wordware -- an IDE for Natural Language Programming and Agent Orchestration. Previously I cofounded and exited KRISTALIC, which tried to augment the human memory. Before that, I studied Deep Learning at Cambridge. \n\nThe most interesting fact about me outside of work is that I travelled to 103 countries and was part of multiple high-altitude mountaineering expeditions and rescue operations in Kyrgyzstan and Nepal. I also do sailing, paragliding, kitesurfing and boxing."
      }
    ],
    "job_description_detailed": "After analyzing the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Not explicitly mentioned, but based on the content, it appears to be a Technical Evangelist or Developer Advocate role.\n\n**Job Summary:**\n\n* The company is creating a new programming paradigm based on natural language and needs someone to bridge the gap between traditional developers and the next wave of AI builders.\n* The ideal candidate will build demos, create content, and shape the explore page into a GitHub-like platform for AI.\n\n**Responsibilities:**\n\n* Building killer demos and examples\n* Shaping the explore page\n* Creating technical content\n\n**Requirements:**\n\n* Be a developer who loves to teach\n* Have real experience with LLMs and AI\n* Understand RAG, agents, and prompt engineering\n* Know how to make complex demos simple\n* Be comfortable on camera and stage\n* Actually enjoy talking to people\n\n**Nice to Have:**\n\n* Previous devrel experience\n* Content creation background\n* Open source contributions\n* Experience building communities\n\n**Work Environment:**\n\n* SF only - no remote work\n* One of the faces of Wordware\n* Lots of context switching between coding and communication\n* Need to understand the product deeply\n* Demos will be used by hundreds of thousands of people\n* Weird company culture, with crossbow competitions on Sundays and a sauna in the office\n\n**Ideal Candidate:**\n\n* Has built demos that made developers excited\n* Can explain complex tech in simple ways\n* Wants to shape how people learn AI\n* Dreams of building GitHub for AI\n\n**Company Information:**\n\n* Backed by Spark Capital, Felicis, and Y Combinator ($30m seed)\n* Works like a seed startup despite being well-funded."
  },
  {
    "company_name": "Corgi",
    "batch": "S24",
    "description": "Corgi is building an AI insurance company",
    "company_link": "https://www.workatastartup.com/companies/corgi",
    "job_name": "Senior Engineer",
    "job_link": "https://www.ycombinator.com/companies/corgi/jobs/YsjMygb-senior-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Nico Laqua",
        "linkedin_url": "https://www.linkedin.com/in/nico-laqua-302b17233",
        "bio": "CEO/CTO of corgi - we do ai insurance.\n\nI previously founded Basket, a gaming publisher with 200+ million MAU."
      },
      {
        "name": "Emily Yuan",
        "linkedin_url": "https://www.linkedin.com/in/emilyyuan96",
        "bio": "Emily is Co-Founder and COO at Corgi 🐕 She dropped out of Stanford as a CS undergrad to co-found Basket Entertainment, a gaming company with over 150 games and 200 million monthly players (including around 1 in 3 American teens)."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Full Stack Engineer\n\n**Job Requirements:**\n\n* Strong experience with Python or Go\n* Hands-on experience training ML models, building chatbots, or using AI APIs\n* Expertise in web scraping and automation tools\n* Proficiency in React and Next.js\n* Experience deploying on AWS, GCP, or DigitalOcean, with Docker skills and the ability to set up databases and queues (e.g., Redis, RabbitMQ)\n* Proven experience building and maintaining projects used by real users (not just one-off experiments)\n* 1+ years of professional (non-internship) experience\n* Started coding before college\n\n**What the company is looking for in a candidate:**\n\n* Skilled, proactive, and easy to collaborate with\n* Mix of technical depth and hands-on experience building real-world products\n\n**Why join the company:**\n\n* Work on impactful, real-world problems at the intersection of AI and insurance\n* Be part of a YC-funded startup with experienced founders\n* Build and scale a product from the ground up\n* Competitive salary and equity\n\n**Application instructions:**\n\n* Send a link to a 1-minute video introducing yourself\n* Tell us about:\n\t+ Startups (or projects) you've worked on in the past\n\t+ A demo of your work\n\t+ Something you're most proud of\n\t+ What gets you going"
  },
  {
    "company_name": "Corgi",
    "batch": "S24",
    "description": "Corgi is building an AI insurance company",
    "company_link": "https://www.workatastartup.com/companies/corgi",
    "job_name": "Golang Developer / Full-Stack Engineer",
    "job_link": "https://www.ycombinator.com/companies/corgi/jobs/1iSMdrS-golang-developer-full-stack-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Nico Laqua",
        "linkedin_url": "https://www.linkedin.com/in/nico-laqua-302b17233",
        "bio": "CEO/CTO of corgi - we do ai insurance.\n\nI previously founded Basket, a gaming publisher with 200+ million MAU."
      },
      {
        "name": "Emily Yuan",
        "linkedin_url": "https://www.linkedin.com/in/emilyyuan96",
        "bio": "Emily is Co-Founder and COO at Corgi 🐕 She dropped out of Stanford as a CS undergrad to co-found Basket Entertainment, a gaming company with over 150 games and 200 million monthly players (including around 1 in 3 American teens)."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Requirements:**\n\n* 1-2 years of production Go experience\n* Not afraid of touching frontend: React, TypeScript\n* Hands-on experience deploying and maintaining applications on AWS/GCP/DigitalOcean\n* Strong background in Docker containerization and database management\n* Ability to own features end-to-end, from backend to frontend\n* Proven experience building and maintaining projects used by real users\n* AI/ML experience preferred\n\n**What the Company is Looking For:**\n\n* Engineers who love the startup grind\n* Ability to write quality, maintainable code fast\n* Desire to ship products, not just fiddle around\n\n**Why Join the Company:**\n\n* Work on impactful, real-world problems at the intersection of AI and insurance\n* Be part of a YC-funded startup with experienced founders\n* Build and scale a product from the ground up\n* Competitive salary and equity\n\n**Application Instructions:**\n\n* Send a link to a 1-minute video introducing yourself\n* Tell us about:\n\t+ Startups (or projects) you've worked on in the past\n\t+ A demo of your work\n\t+ Something you're most proud of\n\t+ What gets you going"
  },
  {
    "company_name": "Phonely",
    "batch": "S24",
    "description": "AI call centers",
    "company_link": "https://www.workatastartup.com/companies/phonely",
    "job_name": "Founding Forward Deployed Engineer",
    "job_link": "https://www.ycombinator.com/companies/phonely/jobs/Raj2SfD-founding-forward-deployed-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Will Bodewes",
        "linkedin_url": "https://www.linkedin.com/in/william-bodewes/",
        "bio": "Will Bodewes is the co-founder and CEO of Phonely. \n\nPrior to starting Phonely, he was pursuing a PhD at the University of Melbourne researching applied artificial intelligence applications.  Before that, he founded an audio-tech startup that garnished celebrity engagement from Chance the Rapper, the band ASIA and more. During college, he competed in the NCAA's for XC skiing, and was one of the top ultra-endurance cyclists in the world."
      },
      {
        "name": "Nisal Ranasinghe",
        "linkedin_url": "https://www.linkedin.com/in/nisalr",
        "bio": "Nisal is the Co-founder and CTO of Phonely. With a background in Electronic and Telecommunications Engineering, he worked as a senior engineer in the AI team of a major telecommunications company for nearly three years, where he led projects on advanced AI solutions. Nisal then pursued a PhD at the University of Melbourne, focusing on explainable AI and AI for healthcare."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Forward Deployed Engineer\n\n**Location:** San Francisco (or willing to relocate)\n\n**Job Summary:**\n\n* Work directly with customers to understand technical needs and build integrations\n* Solve critical technical issues in real-time, troubleshooting infrastructure and API failures\n* Write production-level code to develop custom integrations, scripts, and automation\n* Read and interpret API documentation to integrate third-party systems with Phonely\n\n**Required Competencies:**\n\n* Strong programming ability with experience in backend engineering, API integrations, or full-stack development\n* Problem solver with a consultant mindset—able to diagnose issues and build solutions quickly\n* Clear communicator who can explain complex technical topics simply\n* High execution mentality—moves fast and takes ownership of outcomes\n\n**Why Join Us:**\n\n* Work on the future of AI voice technology, solving problems that no humans have ever solved before, and changing the way people answer the phone forever\n* Experience rapid growth and be part of a company that's scaling quickly\n* Collaborate with a team of talented individuals who are passionate about building cutting-edge AI technology\n\n**Tech Stack:**\n\n* Core Technologies: Python, Next.js, TypeScript\n* AI Tools: OpenAI, Llama 3, Anthropic, Speech-to-Text, Text-to-Speech\n* Infrastructure: GCP, Kubernetes, Datadog\n\n**Who Should Apply:**\n\n* Individuals with experience working in high-growth startups and thriving in fast-paced environments\n* Self-starters who take ownership and get things done without waiting for direction\n* Those with a strong technical background and a passion for working on cutting-edge AI technology\n* Individuals who want to shape the future of real-time AI-powered voice interactions\n* Those who are eager to work with a talented team and build something innovative"
  },
  {
    "company_name": "Phonely",
    "batch": "S24",
    "description": "AI call centers",
    "company_link": "https://www.workatastartup.com/companies/phonely",
    "job_name": "Founding Engineer (Backend)",
    "job_link": "https://www.ycombinator.com/companies/phonely/jobs/YIcOA27-founding-engineer-backend",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Backend",
    "founders": [
      {
        "name": "Will Bodewes",
        "linkedin_url": "https://www.linkedin.com/in/william-bodewes/",
        "bio": "Will Bodewes is the co-founder and CEO of Phonely. \n\nPrior to starting Phonely, he was pursuing a PhD at the University of Melbourne researching applied artificial intelligence applications.  Before that, he founded an audio-tech startup that garnished celebrity engagement from Chance the Rapper, the band ASIA and more. During college, he competed in the NCAA's for XC skiing, and was one of the top ultra-endurance cyclists in the world."
      },
      {
        "name": "Nisal Ranasinghe",
        "linkedin_url": "https://www.linkedin.com/in/nisalr",
        "bio": "Nisal is the Co-founder and CTO of Phonely. With a background in Electronic and Telecommunications Engineering, he worked as a senior engineer in the AI team of a major telecommunications company for nearly three years, where he led projects on advanced AI solutions. Nisal then pursued a PhD at the University of Melbourne, focusing on explainable AI and AI for healthcare."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Senior Backend Engineer\n\n**Location:** San Francisco (or willing to relocate)\n\n**Job Description:**\n\n* **What You Will Do:**\n\t+ Build and scale real-time AI systems by designing and deploying highly scalable backend services.\n\t+ Optimize performance and reliability by improving logging, monitoring, and telemetry (Datadog or similar).\n\t+ Deploy and maintain AI systems in production with robust deployment pipelines and CI/CD automation.\n\t+ Work with LLMs and OpenAI APIs, especially asynchronous API handling.\n\t+ Improve system resilience through containerization (Docker, Kubernetes), distributed systems, and NoSQL databases.\n\n**Competencies:**\n\n* 3+ years of experience running production systems and building deployment pipelines.\n* Strong knowledge of Kubernetes, cloud infrastructure (GCP preferred), and CI/CD automation.\n* Experience working with Python backend engineering, LLMs, and real-time AI systems.\n* Ability to optimize for high availability, performance, and cost efficiency.\n* Bonus: Experience in voice AI and/or hyper-growth startup environments.\n\n**Tech Stack:**\n\n* Core Technologies: Python, Next.js, TypeScript\n* AI Tools: OpenAI, Llama 3, Anthropic, Speech-to-Text, Text-to-Speech\n* Infrastructure: GCP, Kubernetes, Datadog\n\n**Who Should Apply:**\n\n* You have experience working in high-growth startups and thrive in fast-paced environments.\n* You take ownership and get things done without waiting for direction.\n* You have a strong technical background and are eager to work on cutting-edge AI.\n* You want to shape the future of real-time AI-powered voice interactions.\n\n**Call to Action:** Apply now and help build the next generation of voice AI at Phonely."
  },
  {
    "company_name": "Entangl",
    "batch": "S24",
    "description": "Find & resolve issues in data center engineering & operations using AI",
    "company_link": "https://www.workatastartup.com/companies/entangl",
    "job_name": "Full Stack Engineer",
    "job_link": "https://www.ycombinator.com/companies/entangl/jobs/eXa7z60-full-stack-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Shapol M",
        "linkedin_url": "https://linkedin.com/in/shapol",
        "bio": "Co-founder & CEO at Entangl."
      },
      {
        "name": "Antanas Zilinskas",
        "linkedin_url": "https://www.linkedin.com/in/antanaszilinskas",
        "bio": "Co-founder and CTO at Entangl."
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Full Stack Engineer\n\n**About the Role:**\nAs a Full Stack Engineer at entangl, you will play a pivotal role in developing and enhancing our software products that power data centers around the world. You’ll work across the entire technology stack—from architecting robust back-end systems to crafting intuitive, dynamic front-end interfaces—ensuring our solutions are scalable, reliable, and user-friendly.\n\n**Core Responsibilities:**\n\n* End-to-End Development:\n\t+ Design, develop, and maintain scalable full-stack applications that integrate complex data pipelines and intuitive user interfaces.\n\t+ Collaborate with cross-functional teams to define requirements and deliver robust solutions that address real-world challenges.\n* Data Integration:\n\t+ Architect and build backend services.\n\t+ Integrate diverse data sources and ensure smooth data flow across systems.\n* User Interface & Experience:\n\t+ Develop interactive, responsive UIs using modern frameworks and design systems.\n\t+ Ensure seamless integration between front-end components and backend services to provide a cohesive user experience.\n* Collaboration & Mentorship:\n\t+ Work closely with deployment engineers and product designers to gather user feedback and iterate on product improvements.\n* Agile & Iterative Development:\n\t+ Participate in code reviews, stand-ups, and agile planning sessions.\n\t+ Rapidly iterate on prototypes and solutions, balancing speed and quality in a CI/CD environment.\n\n**What We Value:**\n\n* User-Centric Mindset:\n\t+ A passion for creating solutions that simplify complex workflows and enhance user experiences.\n\t+ An ability to empathize with both technical and non-technical users to build accessible, high-impact products.\n* Technical Excellence:\n\t+ Strong coding skills and a deep understanding of full-stack development principles.\n\t+ Proven experience building scalable, maintainable software in fast-paced, iterative environments.\n* Collaborative Spirit:\n\t+ Excellent communication skills and a track record of working effectively in cross-functional teams.\n\t+ A willingness to mentor others and contribute to a culture of continuous learning and improvement.\n* Adaptability & Innovation:\n\t+ Comfortable with open-ended challenges and a rapidly evolving technical landscape.\n\t+ A proactive, problem-solving approach with a keen eye for both detail and the bigger picture.\n\n**What We Require:**\n\n* Experience:\n\t+ 3+ years of professional full-stack engineering experience.\n\t+ Demonstrated expertise in both front-end development (JavaScript/TypeScript, Svelte) and back-end systems (Python, Node.js, or similar).\n* Technical Skills:\n\t+ Proficiency in building and consuming APIs, working with data integration, and implementing scalable microservices.\n\t+ Familiarity with CI/CD pipelines, version control systems (Git), and modern development practices.\n* Soft Skills:\n\t+ Strong written and verbal communication skills.\n\t+ Ability to work independently and as part of a dynamic team in a fast-paced environment.\n* Education:\n\t+ Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).\n\nLet me know if you'd like me to extract any other information!"
  },
  {
    "company_name": "Entangl",
    "batch": "S24",
    "description": "Find & resolve issues in data center engineering & operations using AI",
    "company_link": "https://www.workatastartup.com/companies/entangl",
    "job_name": "Full Stack Engineer",
    "job_link": "https://www.ycombinator.com/companies/entangl/jobs/2Yyvqxs-full-stack-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Shapol M",
        "linkedin_url": "https://linkedin.com/in/shapol",
        "bio": "Co-founder & CEO at Entangl."
      },
      {
        "name": "Antanas Zilinskas",
        "linkedin_url": "https://www.linkedin.com/in/antanaszilinskas",
        "bio": "Co-founder and CTO at Entangl."
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Full Stack Engineer\n\n**Job Summary:** \nAs a Full Stack Engineer at entangl, you will play a pivotal role in developing and enhancing software products that power data centers around the world. You’ll work across the entire technology stack—from architecting robust back-end systems to crafting intuitive, dynamic front-end interfaces—ensuring our solutions are scalable, reliable, and user-friendly.\n\n**Core Responsibilities:**\n\n* End-to-End Development:\n\t+ Design, develop, and maintain scalable full-stack applications that integrate complex data pipelines and intuitive user interfaces.\n\t+ Collaborate with cross-functional teams to define requirements and deliver robust solutions that address real-world challenges.\n* Data Integration:\n\t+ Architect and build backend services.\n\t+ Integrate diverse data sources and ensure smooth data flow across systems.\n* User Interface & Experience:\n\t+ Develop interactive, responsive UIs using modern frameworks and design systems.\n\t+ Ensure seamless integration between front-end components and backend services to provide a cohesive user experience.\n* Collaboration & Mentorship:\n\t+ Work closely with deployment engineers and product designers to gather user feedback and iterate on product improvements.\n* Agile & Iterative Development:\n\t+ Participate in code reviews, stand-ups, and agile planning sessions.\n\t+ Rapidly iterate on prototypes and solutions, balancing speed and quality in a CI/CD environment.\n\n**Requirements:**\n\n* 3+ years of professional full-stack engineering experience.\n* Demonstrated expertise in both front-end development (JavaScript/TypeScript, Svelte) and back-end systems (Python, Node.js, or similar).\n* Proficiency in building and consuming APIs, working with data integration, and implementing scalable microservices.\n* Familiarity with CI/CD pipelines, version control systems (Git), and modern development practices.\n* Strong written and verbal communication skills.\n* Ability to work independently and as part of a dynamic team in a fast-paced environment.\n* Bachelor’s degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).\n\n**What We Value:**\n\n* User-Centric Mindset:\n\t+ A passion for creating solutions that simplify complex workflows and enhance user experiences.\n\t+ An ability to empathize with both technical and non-technical users to build accessible, high-impact products.\n* Technical Excellence:\n\t+ Strong coding skills and a deep understanding of full-stack development principles.\n\t+ Proven experience building scalable, maintainable software in fast-paced, iterative environments.\n* Collaborative Spirit:\n\t+ Excellent communication skills and a track record of working effectively in cross-functional teams.\n\t+ A willingness to mentor others and contribute to a culture of continuous learning and improvement.\n* Adaptability & Innovation:\n\t+ Comfortable with open-ended challenges and a rapidly evolving technical landscape.\n\t+ A proactive, problem-solving approach with a keen eye for both detail and the bigger picture."
  },
  {
    "company_name": "Theseus",
    "batch": "S24",
    "description": "GPS Denied Navigation for Drones",
    "company_link": "https://www.workatastartup.com/companies/theseus",
    "job_name": "Founding Embedded Software Engineer",
    "job_link": "https://www.ycombinator.com/companies/theseus/jobs/lS0uhdA-founding-embedded-software-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Embedded systems",
    "founders": [
      {
        "name": "Ian Laffey",
        "linkedin_url": "https://linkedin.com/in/ian-laffey-943200247",
        "bio": "GPS-denied nav for drones"
      },
      {
        "name": "Sacha Levy",
        "linkedin_url": "https://linkedin.com/in/sacha-levy",
        "bio": "UAV nav in gps denied environments."
      },
      {
        "name": "Carl Schoeller",
        "linkedin_url": "https://www.linkedin.com/in/carlscho",
        "bio": "Building Theseus – defense systems independent of GPS. Before that designed and built around 2000 unique parts. Some of those are in mass production on Tesla Cybertruck and some in an Apple product."
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Founding Embedded Software Engineer\n\n**Job Summary:** Design, implement, and maintain the core embedded software and systems infrastructure for the VPS (Visual Positioning System) for autonomous drone localization in contested environments.\n\n**Responsibilities:**\n\n* Design, implement, and optimize software for resource-constrained hardware\n* Integrate sensors and autopilot interfaces into unified data pipelines\n* Configure and maintain logging frameworks, system daemons, and networking protocols\n* Develop fail-safe logic, error handling, and fallback strategies for mission-critical operations\n* Make key decisions around system architecture\n* Work with QA, perception/SLAM teams, and hardware vendors to unify system architecture\n\n**Requirements:**\n\n* 2+ years professional experience in software engineering (professional or OSS) working with C++/Rust\n* Ability to isolate and fix non-trivial hardware/software integration issues using instrumentation and systematic testing\n\n**Nice to Have's:**\n\n* Experience working with vision-based systems\n* Experience implementing and troubleshooting embedded communication protocols (e.g., TCP/UDP, UART) in production environments\n* Experience with cross-compilation, Docker-based builds, automated test frameworks, and CI/CD for ARM or similar SBCs\n* UAV/robotics background (PX4, Ardupilot)\n* Startup experience scaling hardware products\n\n**Benefits:**\n\n* Competitive salary and equity package\n* Opportunity to be part of the founding team, with direct influence over product and company direction\n* Comprehensive health benefits\n* Office in San Francisco with easy CalTrain / I280 access"
  },
  {
    "company_name": "Theseus",
    "batch": "S24",
    "description": "GPS Denied Navigation for Drones",
    "company_link": "https://www.workatastartup.com/companies/theseus",
    "job_name": "Founding Localization Engineer",
    "job_link": "https://www.ycombinator.com/companies/theseus/jobs/iVNdUWO-founding-localization-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Robotics",
    "founders": [
      {
        "name": "Ian Laffey",
        "linkedin_url": "https://linkedin.com/in/ian-laffey-943200247",
        "bio": "GPS-denied nav for drones"
      },
      {
        "name": "Sacha Levy",
        "linkedin_url": "https://linkedin.com/in/sacha-levy",
        "bio": "UAV nav in gps denied environments."
      },
      {
        "name": "Carl Schoeller",
        "linkedin_url": "https://www.linkedin.com/in/carlscho",
        "bio": "Building Theseus – defense systems independent of GPS. Before that designed and built around 2000 unique parts. Some of those are in mass production on Tesla Cybertruck and some in an Apple product."
      }
    ],
    "job_description_detailed": "Here is the extracted information related to the job description:\n\n**Job Title:** Founding Engineer\n\n**Job Summary:** \nThe company is seeking a Founding Engineer with deep expertise in embedded engineering and robotics localization to join their team. The ideal candidate will be instrumental in shaping the future of Theseus and will grow with the company as it scales.\n\n**Responsibilities:**\n\n* Lead the development and optimization of the visual navigation system, ensuring high accuracy and performance across large fleets of drones.\n* Design, test, and implement embedded software with a focus on vision-based robotics, ensuring they meet cost, SWAP (Size, Weight, and Power), and performance constraints.\n* Make key decisions around system architecture, balancing execution risk, lead time, and cost to deliver scalable, reliable solutions.\n* Work closely with vendors and suppliers, managing external relationships to ensure performance of hardware components for the software.\n* Drive fleet management strategies, overseeing QA for large deployments and proactively addressing issues that arise in the field.\n\n**Requirements:**\n\n* Over one year of experience in embedded hardware, including over one year working on systems that involve cameras or VIO (Visual Inertial Odometry).\n* Proficient in writing embedded C++ code, troubleshooting both hardware and software issues.\n* Demonstrated ability to balance technical trade-offs (SWAP, cost, lead time) and develop solutions that prioritize scalability and cost-efficiency.\n* Experience managing fleets of robotic systems, leading QA efforts, and working directly with vendors to troubleshoot and ensure system reliability.\n\n**Nice to Have's:**\n\n* Experience working with drones or other autonomous aerial vehicles.\n* Experience working with the ArduPilot ecosystem.\n* Previous experience in a startup environment or building something from the ground up.\n\n**Benefits:**\n\n* Competitive salary and equity package\n* Opportunity to be part of the founding team, with direct influence over product and company direction\n* Comprehensive health benefits\n* Office in San Francisco with easy CalTrain / I280 access"
  },
  {
    "company_name": "Variant",
    "batch": "F24",
    "description": "Building the state-of-the-art model for software design",
    "company_link": "https://www.workatastartup.com/companies/variant",
    "job_name": "Founding Frontend Engineer (Staff)",
    "job_link": "https://www.ycombinator.com/companies/variant/jobs/ZEEFZxK-founding-frontend-engineer-staff",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Frontend",
    "founders": [
      {
        "name": "Daniel Bulhosa Solorzano",
        "linkedin_url": "https://www.linkedin.com/in/dbulhosa/",
        "bio": "Formerly led simulation & testing for emergency vehicle, human controlling traffic, and school bus interactions at Cruise. Worked on generative AI for simulating road actor behavior in the same. Previously led machine learning at the Square Ecommerce team, where he built the ML features of the Photo Studio mobile app and the PDF to catalog importer feature."
      },
      {
        "name": "Benjamin South Lee",
        "linkedin_url": "https://linkedin.com/in/hoopla",
        "bio": "Building Variant. Formerly founded two companies which were acquired by Postmates, where I was VP of Product Design, and Avara, where I was SVP of Product and Design. \n\nExperiments: bensouth.com"
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Founding Engineer (Front-end)\n\n**Responsibilities:**\n\n* Own the front-end of Variant\n\n**Requirements:**\n\n* At least one of:\n\t+ Has done impactful work at a company known for its front-end and design\n\t+ Majorly contributed to a notable open source project\n\t+ Has a seriously impressive portfolio\n* Works with modern frameworks like React, Next, Svelte, etc.\n* Deeply understands the DOM and the browser\n* Ships performant, pixel-perfect components\n* Knows that building a startup is really hard work and is fully committed\n* Doesn't compromise between quality and shipping fast\n* Sees what needs to be done and does it\n* Under promises, over delivers\n* Knows when to be outspoken or disagree and commit\n\n**What the company offers:**\n\n* The opportunity to work on meaningful projects that will have a significant impact\n* A small team by design, where your code will matter from day one\n* A beautiful workspace in San Francisco\n* Well-capitalized and backed by notable investors\n\n**Company culture:**\n\n* Emphasis on quality and shipping fast\n* Encourages outspokenness and commitment\n* Values under promising and over delivering"
  },
  {
    "company_name": "Powder",
    "batch": "W24",
    "description": "AI Agents for precise document analysis",
    "company_link": "https://www.workatastartup.com/companies/powder",
    "job_name": "Founding Full Stack Engineer",
    "job_link": "https://www.ycombinator.com/companies/powder/jobs/nPIU29b-founding-full-stack-engineer",
    "job_type": "fulltime",
    "location": "Redwood City, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Soo Yung Cho",
        "linkedin_url": "https://linkedin.com/in/soo-yung-cho-53643811",
        "bio": "Sooyung is the co-founder and CTO of Powder, AI sales copilot for wealth advisors. Prior to founding Powder, Sooyung was a founding team member of RCI which was acquired by Addepar in 2021. Sooyung graduated from Johns Hopkins with a BS degree in Computer Science. Out of work, he enjoys playing lacrosse."
      },
      {
        "name": "David Goerz",
        "linkedin_url": "https://linkedin.com/in/davidgoerz3",
        "bio": "Co-founder & Chief Investment Officer for Powder Finance, which is building an AI Sales co-Pilot for wealth advisors to automate gathering financial holdings, analyze portfolios, assess risk tolerance, and summarize data to engage faster and efficiently.\n\nHe managed portfolio strategies for institutional asset owners for 33 yrs on mandates up to $30B in assets with pioneering innovations in quantitative equity and return forecasting, optimization and risk management. Chair, Investment Committees"
      },
      {
        "name": "Kanishk Parashar",
        "linkedin_url": "https://linkedin.com/in/diamondk",
        "bio": "cofounder/CEO Powder - AI growth platform for wealth advisors.  Previously, I was cofounder/CEO of RCI Navigator.  Navigator helps asset and wealth managers to pace into private assets such as VC, PE, Infra, etc. while taking risks into account.  It was acquired by Addepar in Jan 2021.  Navigator is used by 150+ firms including UBS and Morgan Stanley.  Before that I was cofounder/CEO of Coin (YCW13).  Coin was a all-in-one digital credit card that combined all your cards into one."
      },
      {
        "name": "Dominic Tully",
        "linkedin_url": "https://linkedin.com/in/dominic-tully-b9418292",
        "bio": "I am currently the co-founder and Head of Sales and Operations at Powder. Prior to Powder, I work at the fintech firm, Addepar, as both a Senior Account Executive and Senior Account Manager. I started my career at Goldman Sachs, where I worked in the Private Wealth Management division in San Francisco."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I extracted the following information related to the job description:\n\n**Job Summary:**\nThe job is for a motivated candidate who will thrive in a fast-paced startup environment and support the company's objectives. The role involves designing, developing, and maintaining both front-end and back-end components of software applications.\n\n**Key Responsibilities:**\n\n1. Design, develop, and maintain end-to-end software solutions, including both front-end and back-end components.\n2. Collaborate with product managers, designers, and other developers to define project requirements and deliver high-quality features.\n3. Write clean, maintainable, and efficient code, following best practices and coding standards.\n4. Troubleshoot, debug, and resolve software defects and performance issues.\n5. Stay up-to-date with emerging trends and technologies in software development and apply them to improve products.\n6. Participate in all phases of the software development lifecycle, including planning, design, implementation, testing, and deployment.\n7. Contribute to the continuous improvement of development processes and tools.\n\n**Requirements:**\n\n1. Bachelor's degree in Computer Science, Software Engineering, or a related field, or equivalent practical experience.\n2. Minimum 4 years of experience as a Full Stack Developer or similar role.\n3. Proficiency in modern front-end technologies like React, Angular, or Vue.js.\n4. Strong experience with back-end technologies such as Node.js, Python, Ruby, or Java.\n5. Familiarity with relational database management systems such as Postgres and MySQL.\n6. Knowledge of cloud platforms (e.g., AWS, Azure, Google Cloud).\n7. Excellent problem-solving skills and the ability to work independently and collaboratively in a fast-paced environment.\n8. Excellent communication skills, with the ability to articulate complex technical concepts to non-technical stakeholders.\n9. Experience with AI platforms and technologies, including generative AI models and LLMs (nice to have).\n\nLet me know if you'd like me to extract any further information!"
  },
  {
    "company_name": "CommodityAI",
    "batch": "W24",
    "description": "AI & Automation Software Powering Physical Commodity Trading",
    "company_link": "https://www.workatastartup.com/companies/commodityai",
    "job_name": "Founding Engineer",
    "job_link": "https://www.ycombinator.com/companies/commodityai/jobs/yZkCefX-founding-engineer",
    "job_type": "fulltime",
    "location": "San Francisco, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Daniel Cervoni",
        "linkedin_url": "https://www.linkedin.com/in/dcervoni/",
        "bio": "Head of Engineering & Co-Founder at CommodityAI"
      },
      {
        "name": "Kyle Franz",
        "linkedin_url": "https://linkedin.com/in/kyle-manuel-franz-7a4351a8",
        "bio": "CTO & Co-Founder at CommodityAI"
      },
      {
        "name": "Philip Koenig",
        "linkedin_url": "https://linkedin.com/in/philipkoenig",
        "bio": "CEO & Cofounder at CommodityAI"
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I've extracted the information related to the job description:\n\n**Job Title:** Founding Engineer\n\n**Job Summary:**\n\n* Join a YC-backed company driving AI adoption within physical commodity trading\n* Work closely with a hands-on founding team to shape the future of the product and company\n* Take ownership, drive initiatives, and make smart decisions that align with the realities of a startup environment\n\n**Responsibilities:**\n\n* Provide technical leadership\n* Work across all parts of the product\n* Make decisions, own features, and help drive tech and product forward\n* Make intelligent trade-offs and decisions that balance short-term needs with long-term goals\n* Take ownership, drive initiatives, and make smart decisions\n\n**Requirements:**\n\n* 4+ years of experience in software engineering with a proven track record of exceptional work\n* Outstanding coding skills and the ability to quickly master new languages or frameworks\n* Familiarity with tools and technologies like React, TypeScript, Go, Java, Mongo, Node, SQL, and Python is a plus\n* Strong analytical skills with the ability to make data-driven decisions and offer clear, strategic recommendations\n* Demonstrated expertise and depth in a specific domain, with a curiosity that drives you to explore and understand the complexities and nuances of the problems you work on\n* Genuine passion for tackling complex problems and an authentic interest in the commodities trading or logistics space\n* Ready to engage with customers daily and make meaningful contributions to their implementations\n\n**Benefits:**\n\n* Competitive salary\n* Meaningful equity in a rapidly growing company\n* Flexible working arrangements, with a hybrid office schedule\n* Comprehensive health, dental, and vision insurance\n* Opportunity to shape the future of an old-school yet existentially vital industry to the world\n* A collaborative and fast-paced environment where your work has consequence and impact"
  },
  {
    "company_name": "Retell AI",
    "batch": "W24",
    "description": "Supercharge Your Contact Center Operations with AI Phone Agents",
    "company_link": "https://www.workatastartup.com/companies/retell-ai",
    "job_name": "Founding Senior Software Engineer (Forward Deployed)",
    "job_link": "https://www.ycombinator.com/companies/retell-ai/jobs/1okdYK9-founding-senior-software-engineer-forward-deployed",
    "job_type": "fulltime",
    "location": "Redwood City, CA, US",
    "tech_stack": "Full stack",
    "founders": [
      {
        "name": "Todd Li",
        "linkedin_url": "https://linkedin.com/in/zhengtaoli",
        "bio": "Todd is the founder of several venture-backed startups. Before his startup journey at Retell, Todd worked at Google Ads as a software engineer."
      },
      {
        "name": "Evie Wang",
        "linkedin_url": "https://linkedin.com/in/yanwang131415",
        "bio": "Evie is the Co-founder and CMO of Retell AI\nShe has a design background and a deep understanding of B2B business as she spent 3 years as a Product Designer at Bytedance."
      },
      {
        "name": "Bing Wu",
        "linkedin_url": "https://linkedin.com/in/binw",
        "bio": "Co-founder & CEO at Retell AI.\nEnthusiastic about the human brain and AI, Bing spent three years as a product manager at ByteDance/TikTok, where he led B2B and consumer products that delighted billions.\n\nBefore joining ByteDance/TikTok, Bing founded two investor-backed startups in college, generating six-figure revenues."
      },
      {
        "name": "Weijia Yu",
        "linkedin_url": "https://linkedin.com/in/weijia-y-76b816194",
        "bio": "Weijia excels in product and software development, with a specialization in machine learning. At Meta, he spent three years as a PM hybrid Tech Lead within Facebook product team.\n\nPrior to Meta, Weijia led app development at ObEN, a Series B AI tech startup, providing full-stack AI solutions including TTS(text-to-speech), computer vision and chatbot."
      },
      {
        "name": "Zexia Zhang",
        "linkedin_url": "https://linkedin.com/in/zexia-zhang-171480133",
        "bio": "Zexia is the co-founder and CTO of Retell AI. Passionate about ML, Zexia is always at the frontier of advancing speech technologies. Before Retell, Zexia spent four years at Google where he led the development of next-gen speech translation experience, and NLP solutions for call analysis."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I extracted the following information related to the job description:\n\n**Job Title:** Founding Senior Solution Engineer\n\n**Job Type:** Full-time, 40 hr/week onsite with flexible hours + 25-30 hr/week work from home\n\n**Salary:** $200K - $310K\n\n**Equity:** 0.5% - 1.25%\n\n**Bonus:** $20k - $100k\n\n**Location:** Redwood City, CA, US\n\n**Visa Sponsorship:** Sponsors Visa & Greencard\n\n**Benefits:**\n\n* 100% medical, dental, vision insurance coverage for the employee\n* Unlimited breakfast, lunch, dinner, and snacks\n* Gym membership\n* Daily commute fee reimbursement\n* Internet and phone bill coverage\n\n**Additional Information:** There is a link to a more detailed role description, which can be found [here](https://chrome-rayon-e18.notion.site/Retell-AI-Founding-Solution-Engineer-Role-19859d7d55d88037afe7fb47654b6201)."
  },
  {
    "company_name": "Retell AI",
    "batch": "W24",
    "description": "Supercharge Your Contact Center Operations with AI Phone Agents",
    "company_link": "https://www.workatastartup.com/companies/retell-ai",
    "job_name": "Founding Senior Software Engineer (Backend)",
    "job_link": "https://www.ycombinator.com/companies/retell-ai/jobs/3yPgfmB-founding-senior-software-engineer-backend",
    "job_type": "fulltime",
    "location": "Redwood City, CA, US",
    "tech_stack": "Backend",
    "founders": [
      {
        "name": "Todd Li",
        "linkedin_url": "https://linkedin.com/in/zhengtaoli",
        "bio": "Todd is the founder of several venture-backed startups. Before his startup journey at Retell, Todd worked at Google Ads as a software engineer."
      },
      {
        "name": "Evie Wang",
        "linkedin_url": "https://linkedin.com/in/yanwang131415",
        "bio": "Evie is the Co-founder and CMO of Retell AI\nShe has a design background and a deep understanding of B2B business as she spent 3 years as a Product Designer at Bytedance."
      },
      {
        "name": "Bing Wu",
        "linkedin_url": "https://linkedin.com/in/binw",
        "bio": "Co-founder & CEO at Retell AI.\nEnthusiastic about the human brain and AI, Bing spent three years as a product manager at ByteDance/TikTok, where he led B2B and consumer products that delighted billions.\n\nBefore joining ByteDance/TikTok, Bing founded two investor-backed startups in college, generating six-figure revenues."
      },
      {
        "name": "Weijia Yu",
        "linkedin_url": "https://linkedin.com/in/weijia-y-76b816194",
        "bio": "Weijia excels in product and software development, with a specialization in machine learning. At Meta, he spent three years as a PM hybrid Tech Lead within Facebook product team.\n\nPrior to Meta, Weijia led app development at ObEN, a Series B AI tech startup, providing full-stack AI solutions including TTS(text-to-speech), computer vision and chatbot."
      },
      {
        "name": "Zexia Zhang",
        "linkedin_url": "https://linkedin.com/in/zexia-zhang-171480133",
        "bio": "Zexia is the co-founder and CTO of Retell AI. Passionate about ML, Zexia is always at the frontier of advancing speech technologies. Before Retell, Zexia spent four years at Google where he led the development of next-gen speech translation experience, and NLP solutions for call analysis."
      }
    ],
    "job_description_detailed": "Based on the provided HTML, I extracted the following information related to the job description:\n\n**Job Title:** Founding Senior Software Engineer\n\n**Job Type:** Full-time, 40 hr/week onsite with flexible hours + 25-30 hr/week WFH\n\n**Salary:** $200K - $310K\n\n**Equity:** 0.50% - 1.25%\n\n**Bonus:** $20k - $100K\n\n**Location:** Redwood City, CA, US\n\n**Visa Sponsorship:** Sponsors Visa & Greencard\n\n**Benefits:**\n\n* 100% medical, dental, vision insurance coverage\n* Unlimited breakfast, lunch, dinner, and snacks\n* Gym membership\n* Daily commute fee reimbursement\n* Internet and phone bill coverage\n\n**Additional Information:** There is a link to a Notion page with more details about the role description: https://auspicious-fright-d1c.notion.site/Retell-AI-Founding-Engineer-Role-13e334b239fd80c3affcd28609205c37"
  }
]